Day1/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Day1/src/AccumulationRegisters/ТоварыНаСкладах/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Возвращает остаток по номенклатуре на складах.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура, по которой необходимо получить остатки.
//  Склады - Массив из строка - массив складов, по которым необходимо получить остатки.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - соответствие складов и количества на складах:
//   * Ключ - строка - склад.
//   * Значение - число - количество на складе.
//
//	
Функция ПолучитьОстатокПоНоменклатуре(Номенклатура, Склады) Экспорт
	
	Остатки = Новый Соответствие;
	
	Для Каждого Склад Из Склады Цикл

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	ТоварыНаСкладахОстатки.Склад КАК Склад,
					   |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
					   |ИЗ
					   |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура И Склад = &Склад) КАК ТоварыНаСкладахОстатки";

		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад); 

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл
			Остатки.Вставить(Выборка.Склад, Выборка.Количество);
		КонецЦикла;

	КонецЦикла;

	Возврат Остатки;

КонецФункции

	
#КонецОбласти

#КонецЕсли
